_posts/2013-02-26-Creating-arrays-in-python.html
---
title: Creating arrays in python
date: 2013/02/26 09:00:00
updated: 2013/03/06 19:39:27
categories: python
tags: 
---


<p>
Often, we will have a set of 1-D arrays, and we would like to construct a 2D array with those vectors as either the rows or columns of the array. This may happen because we have data from different sources we want to combine, or because we organize the code with variables that are easy to read, and then want to combine the variables. Here are examples of doing that to get the vectors as the columns.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

<span style="color: #8b0000;">print</span> np.column_stack([a, b])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">this means stack the arrays vertically, e.g. on top of each other</span>
<span style="color: #8b0000;">print</span> np.vstack([a, b]).T
</pre>
</div>

<pre class="example">
[[1 4]
 [2 5]
 [3 6]]
[[1 4]
 [2 5]
 [3 6]]
</pre>

<p>
Or rows:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

<span style="color: #8b0000;">print</span> np.row_stack([a, b])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">this means stack the arrays vertically, e.g. on top of each other</span>
<span style="color: #8b0000;">print</span> np.vstack([a, b])
</pre>
</div>

<pre class="example">
[[1 2 3]
 [4 5 6]]
[[1 2 3]
 [4 5 6]]
</pre>

<p>
The opposite operation is to extract the rows or columns of a 2D array into smaller arrays. We might want to do that to extract a row or column from a calculation for further analysis, or plotting for example. There are splitting functions in numpy. They are somewhat confusing, so we examine some examples. The numpy.hsplit command splits an array &ldquo;horizontally&rdquo;. The best way to think about it is that the &ldquo;splits&rdquo; move horizontally across the array. In other words, you draw a vertical split, move over horizontally, draw another vertical split, etc&hellip; You must specify the number of splits that you want, and the array must be evenly divisible by the number of splits.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = np.array([[1, 2, 3, 5], 
              [4, 5, 6, 9]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">split into two parts</span>
p1, p2 = np.hsplit(A, 2)
<span style="color: #8b0000;">print</span> p1
<span style="color: #8b0000;">print</span> p2

<span style="color: #ff0000; font-weight: bold;">#</span><span style="color: #ff0000; font-weight: bold;">split into 4 parts</span>
p1, p2, p3, p4 = np.hsplit(A, 4)
<span style="color: #8b0000;">print</span> p1
<span style="color: #8b0000;">print</span> p2
<span style="color: #8b0000;">print</span> p3
<span style="color: #8b0000;">print</span> p4
</pre>
</div>

<pre class="example">
[[1 2]
 [4 5]]
[[3 5]
 [6 9]]
[[1]
 [4]]
[[2]
 [5]]
[[3]
 [6]]
[[5]
 [9]]
</pre>

<p>
In the numpy.vsplit command the &ldquo;splits&rdquo; go &ldquo;vertically&rdquo; down the array. Note that the split commands return 2D arrays.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = np.array([[1, 2, 3, 5], 
              [4, 5, 6, 9]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">split into two parts</span>
p1, p2 = np.vsplit(A, 2)
<span style="color: #8b0000;">print</span> p1
<span style="color: #8b0000;">print</span> p2
<span style="color: #8b0000;">print</span> p2.shape
</pre>
</div>

<pre class="example">
[[1 2 3 5]]
[[4 5 6 9]]
(1, 4)
</pre>

<p>
An alternative approach is array unpacking. In this example, we unpack the array into two variables. The array unpacks by row.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = np.array([[1, 2, 3, 5], 
              [4, 5, 6, 9]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">split into two parts</span>
p1, p2 = A
<span style="color: #8b0000;">print</span> p1
<span style="color: #8b0000;">print</span> p2
</pre>
</div>

<pre class="example">
[1 2 3 5]
[4 5 6 9]
</pre>

<p>
To get the columns, just transpose the array.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = np.array([[1, 2, 3, 5], 
              [4, 5, 6, 9]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">split into two parts</span>
p1, p2, p3, p4 = A.T
<span style="color: #8b0000;">print</span> p1
<span style="color: #8b0000;">print</span> p2
<span style="color: #8b0000;">print</span> p3
<span style="color: #8b0000;">print</span> p4
<span style="color: #8b0000;">print</span> p4.shape
</pre>
</div>

<pre class="example">
[1 4]
[2 5]
[3 6]
[5 9]
(2,)
</pre>

<p>
Note that now, we have 1D arrays.
</p>

<p>
You can also access rows and columns by indexing. We index an array by [row, column]. To get a row, we specify the row number, and all the columns in that row like this [row, :]. Similarly, to get a column, we specify that we want all rows in that column like this: [:, column]. This approach is useful when you only want a few columns or rows.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

A = np.array([[1, 2, 3, 5], 
              [4, 5, 6, 9]])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">get row 1</span>
<span style="color: #8b0000;">print</span> A[1]
<span style="color: #8b0000;">print</span> A[1, :]  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">row 1, all columns</span>

<span style="color: #8b0000;">print</span> A[:, 2]  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">get third column </span>
<span style="color: #8b0000;">print</span> A[:, 2].shape
</pre>
</div>

<pre class="example">
[4 5 6 9]
[4 5 6 9]
[3 6]
(2,)
</pre>

<p>
Note that even when we specify a column, it is returned as a 1D array.</p>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/02/26/Creating-arrays-in-python.org">org-mode source</a><p>